// Напишите программу, которая принимает на вход три числа и проверяет, может ли существовать треугольник с сторонами такой длины.

int x=12;
string bin= Convert.ToString(x,2);
 
Console.WriteLine(bin)












